{
  "name": "STORYTELLING (M4)",
  "sections": [
    {
      "id": "general",
      "title": "General",
      "responses": [
        {
          "id": "g1",
          "name": "Accuracy",
          "include": true,
          "options": {
            "Doing Too Much": "Make sure that you are still hitting the essentials, and carefully evaluating decisions around introducing additional elements (such as color).",
            "Inaccurate": "Some of the charts were inaccurate to what was expected from the instructions. Make sure to pick out essential pieces of the prompts and refer to the example visualizations to guide your process."
          }
        },
        {
          "id": "g2",
          "name": "Color",
          "include": true,
          "options": {
            "Misused": "The color can get in the way of the visualizations. Human brains are naturally pattern seeking, and incorrect uses of color get in the way of that process. It also introduces potential issues around accessability around colorblindness (or low vision, if high-contrast designs are needed). Keep using color in your visualizations, but make sure that it is always intentional and compliments your work.",
            "Underused": ""
          }
        },
        {
          "id": "g3",
          "name": "Late",
          "include": true,
          "options": {
            "Late Verbage": "Make sure to give yourself enough time to get the milestone in on time. Alternatively, if you have a valid reason for being late, make sure to reach out to HelpHub to get the extension. I want to make sure you get full credit for the work that you do."
          }
        }
      ]
    },
    {
      "id": "free_response",
      "title": "Free-Response",
      "responses": [
        {
          "id": "fr1",
          "name": "",
          "include": true,
          "options": {
            "Accurate": "",
            "Inaccurate": ""
          }
        },
        {
          "id": "fr2",
          "name": "",
          "include": true,
          "options": {
            "Thorough and Insightful": "",
            "Concise": "",
            "Insufficient": ""
          }
        },
        {
          "id": "fr3",
          "name": "",
          "include": true,
          "options": {
            "Accurate": "",
            "Inaccurate": ""
          }
        },
        {
          "id": "fr4",
          "name": "",
          "include": true,
          "options": {
            "Accurate": "",
            "Inaccurate": ""
          }
        }
      ]
    },
    {
      "id": "charts",
      "title": "Charts",
      "responses": [
        {
          "id": "c1",
          "name": "",
          "include": true,
          "options": {
            "Perfect": "",
            "Filter Error": "",
            "Field Error": "",
            "Field Error (Wrong Height)": "Here you should be using the Above average height variables. These take the original height values and turn them into a boolean value indicating whether each country is above or below that average. We can create the same chlorepleth from these fields, but that is the focus of the LevelUp."
          }
        },
        {
          "id": "c2",
          "name": "",
          "include": true,
          "options": {
            "Perfect": "",
            "Filter Error": "",
            "Field Error": ""
          }
        },
        {
          "id": "c3",
          "name": "",
          "include": true,
          "options": {
            "Perfect": "",
            "Filter Error": "",
            "Field Error": ""
          }
        },
        {
          "id": "c4",
          "name": "",
          "include": true,
          "options": {
            "Perfect": "",
            "Filter Error": "",
            "Field Error": ""
          }
        },
        {
          "id": "c5",
          "name": "",
          "include": true,
          "options": {
            "Perfect": "",
            "Filter Error": "",
            "Field Error": ""
          }
        }
      ]
    },
    {
      "id": "levelup",
      "title": "LevelUp",
      "responses": [
        {
          "id": "lu1",
          "name": "Attempted",
          "include": true,
          "options": {
            "Yes": "",
            "No": ""
          }
        },
        {
          "id": "lu2",
          "name": "Foundation",
          "include": false,
          "options": {
            "Perfect": "",
            "Missing Fields": ""
          }
        },
        {
          "id": "lu3",
          "name": "Writing",
          "include": true,
          "options": {
            "Accurate": "",
            "Concise": "",
            "Inaccurate": ""
          }
        }
      ]
    }
  ],
  "messages": {
    "greeting": {
      "Superior": "This is a superior submission",
      "Strong": "This is a strong submission",
      "Needs Revision": "This is good submission that needs revision",
      "Insufficient": "This milestone has good pieces to build on"
    },
    "intro": {
      "Superior": "Your work demonstrates professionalism, attention to detail, and full-effort throughout. Work like this will set you up as a reliable contributor and foundational team member.",
      "Strong": "Your work is accurate and demonstrates good effort. I recommend implementing the feedback when refining your milestone.",
      "Needs Revision": "Revising your milestone will help you break down the road blocks you encountered, set you up for success with the portfolio project, and prepare this milestone for public sharing. If you spent a lot of time on this milestone and feel frustrated, taking some time away can let you process the problems in the background and reset your perspective.",
      "Insufficient": "I can tell that this milestone was a challenge - either because something with the material didn't click or because you didn't have enough time to process. That's okay and happens to everyone. There's good work to build on here, and I have included detailed feedback to help you revise your submission. Revising your milestone will help you break down the road blocks you encountered, set you up for success with the portfolio project, and prepare this milestone for public sharing. If you spent a lot of time on this milestone and feel frustrated, taking some time away can let you process the problems in the background and reset your perspective."
    },
    "overview": {
      "Superior": "Here is your detailed feedback:",
      "Strong": "Here is your detailed feedback:",
      "Needs Revision": "Here is your detailed feedback:",
      "Insufficient": "Here is your detailed feedback:"
    },
    "conclusion": {
      "Superior": "This is a great start to Tableau, and I look forward to seeing how you develop your data visualizations from here.",
      "Strong": "This is a great start to Tableau, and I look forward to seeing how you develop your data visualizations from here.",
      "Needs Revision": "There is a lot to be proud of, and if you have any questions then make sure to reach out. I look forward to seeing your development as a data visualizer!",
      "Insufficient": "There is a lot to be proud of, and if you have any questions then make sure to reach out. If you get stuck on anything, make sure to use the skillbuilders, materials, drop-ins, and Bodhi your advantage. You got this!"
    },
    "signoff": {
      "Superior": "Take care",
      "Strong": "Take care",
      "Needs Revision": "Take care",
      "Insufficient": "Take care"
    }
  }
}
