{
  "name": "STORYTELLING (M4)",
  "sections": [
    {
      "id": "general",
      "title": "General",
      "responses": [
        {
          "id": "g1",
          "name": "Accuracy",
          "include": true,
          "options": {
            "Doing Too Much": "Make sure that you are still hitting the essentials, and carefully evaluating decisions around introducing additional elements (such as color).",
            "Inaccurate": "Some of the charts were inaccurate to what was expected from the instructions. Make sure to pick out essential pieces of the prompts and refer to the example visualizations to guide your process."
          }
        },
        {
          "id": "g2",
          "name": "Color",
          "include": true,
          "options": {
            "Misused": "The color can get in the way of the visualizations. Human brains are naturally pattern seeking, and incorrect uses of color get in the way of that process. It also introduces potential issues around accessability around colorblindness (or low vision, if high-contrast designs are needed). Keep using color in your visualizations, but make sure that it is always intentional and compliments your work.",
            "Underused": ""
          }
        },
        {
          "id": "g3",
          "name": "Late",
          "include": true,
          "options": {
            "Late Verbage": "Make sure to give yourself enough time to get the milestone in on time. Alternatively, if you have a valid reason for being late, make sure to reach out to HelpHub to get the extension. I want to make sure you get full credit for the work that you do."
          }
        }
      ]
    },
    {
      "id": "free_response",
      "title": "Free-Response",
      "responses": [
        {
          "id": "fr1",
          "name": "Geographical Pattern of Height",
          "include": true,
          "options": {
            "Thorough and Insightful": "This is a thorough and insightful response to the distribution of countries with below average heights.",
            "Concise": "This response is on the shorter end and would benefit from more detail - either in listing the countries, describing the pattern, or in the explanation of the trend.",
            "Inaccurate": "This does not accurately describe the distribution of countries that are below the global average."
          }
        },
        {
          "id": "fr2",
          "name": "3 South American Countries",
          "include": true,
          "options": {
            "Accurate": "Perfect! The three countries are Argentina, Uruguay, and Costa Rica.",
            "Incorrect": "The three countries should be Argentina, Uruguay, and Costa Rica."
          }
        },
        {
          "id": "fr3",
          "name": "Peak Sales",
          "include": true,
          "options": {
            "Thorough and Insightful": "This is a great analysis of the cause of the peak. Switching from physical to digital distribution changed the whole landscape of the music industry.",
            "Concise": "This is a good answer, but it should be expanded. There's a lot to unpack from the chart that we made. For example: Digital downloads changed the landscape of the music industry. Even if we ignore the prevalence of piracy, people were suddenly able to buy an album once and keep downloading it when needed. Physical media carries with it the risk of damage (such as scratches or stretched-out tape decks) that would require someone to purchase a replacement.",
            "Inaccurate": "This answer does not accurately reflect the information shown in the chart. The chart provides good initial observations that can be built upon by further research."
          }
        },
        {
          "id": "fr4",
          "name": "Dominant Formats",
          "include": true,
          "options": {
            "Accurate": "Perfect!",
            "Inaccurate": "In 1980, the main formats were LP/EP and Cassettes. In 2000, CDs dominated the market with 95% of all recorded sales. By 2019, the landscape had once again shifted and was now dominated by paid subscriptions."
          }
        },
        {
          "id": "fr5",
          "name": "Top Video Game Genres",
          "include": true,
          "options": {
            "Accurate": "Perfect wrap up for the written section!",
            "Inaccurate": "The top three video game genres by sales are Action, Sports, and Shooter."
          }
        }
      ]
    },
    {
      "id": "charts",
      "title": "Charts",
      "responses": [
        {
          "id": "c1",
          "name": "Male/Female Heights",
          "include": true,
          "options": {
            "Perfect": "Good work with the Chlorepleths! These are are an easy way to create impressive, insightful, and professional visualizations.",
            "Field Error": "Make sure to put the Above Avg Height and Country fields into the columns/rows before hitting the 'Show Me' button to create the Chlorepleths.",
            "Field Error (Wrong Height)": "Here you should be using the Above average height variables. These take the original height values and turn them into a boolean value indicating whether each country is above or below that average. We can create the same chlorepleth from these fields, but that is the focus of the LevelUp."
          }
        },
        {
          "id": "c2",
          "name": "Overall Music Sales",
          "include": true,
          "options": {
            "Perfect": "This looks perfect.",
            "Field Error": ""
          }
        },
        {
          "id": "c3",
          "name": "Music Sales by Format",
          "include": true,
          "options": {
            "Perfect": "This is perfect! This is one of my favourite visualizations for this milestone because of how much it communicates.",
            "Filter Error": "Make sure to filter the formats to only 'Cassette', 'CD', 'Download', 'LP/EP', and 'Paid Subscriptions'.",
            "Field Error": "The year should be in the columns, and the Sum of Total Sales should be in the rows."
          }
        },
        {
          "id": "c4",
          "name": "Video Game Sales",
          "include": true,
          "options": {
            "Perfect": "This is correct!",
            "Field Error": "This visualization should have the Sum of Global Sales in the columns and the Genre in the rows."
          }
        }
      ]
    },
    {
      "id": "levelup",
      "title": "LevelUp",
      "responses": [
        {
          "id": "lu1",
          "name": "Attempted",
          "include": true,
          "options": {
            "Yes": "Thank you for taking on the LevelUp! While you could do this with a calculated field (like earlier in the milestone), this is a great way to learn about color scale customization.",
            "No": "While note required, I encourage you to try the LevelUp when you have time. This LevelUp does a great job of introducing color scale customization."
          }
        },
        {
          "id": "lu2",
          "name": "Visualization",
          "include": false,
          "options": {
            "Perfect": "Great job creating a stepped chloropleth map to show the distribution of heights across countries!",
            "Stepped Color, Wrong # steps": "Make sure to use the correct number of steps for your color scale. This visualization was aiming for 2.",
            "Field Error": "You can drop the country and sum of Avg Height into the columns/rows before hitting the 'Show Me' button to create the Chlorepleth.",
            "Field Error (Above Avg Height)": "This visualization should use the Average Height data. Using the Above Avg Height field will keep you from seeing how adjusting the color steps affects the chloropleth."
          }
        }
      ]
    }
  ],
  "messages": {
    "greeting": {
      "Superior": "Superior submission",
      "Strong": "Strong submission",
      "Needs Revision": "Good, revisable submission",
      "Insufficient": "This milestone has good pieces to build on"
    },
    "intro": {
      "Superior": "Superior quality work - thank you for the effort that you've put into this!",
      "Strong": "Accurate and good effort! I recommend implementing the feedback when refining your milestone.",
      "Needs Revision": "Revising your milestone will help you break down the road blocks you encountered, set you up for success with the portfolio project, and prepare this milestone for public sharing. If you spent a lot of time on this milestone and feel frustrated, taking some time away can let you process the problems in the background and reset your perspective.",
      "Insufficient": "I can tell that this milestone was a challenge - either because something with the material didn't click or because you didn't have enough time to process. That's okay and happens to everyone. There's good work to build on here, and I have included detailed feedback to help you revise your submission. Revising your milestone will help you break down the road blocks you encountered, set you up for success with the portfolio project, and prepare this milestone for public sharing. If you spent a lot of time on this milestone and feel frustrated, taking some time away can let you process the problems in the background and reset your perspective."
    },
    "overview": {
      "Superior": "Here is your detailed feedback:",
      "Strong": "Here is your detailed feedback:",
      "Needs Revision": "Here is your detailed feedback:",
      "Insufficient": "Here is your detailed feedback:"
    },
    "conclusion": {
      "Superior": "This is a great start to Tableau, and I look forward to seeing how you develop your data visualizations from here.",
      "Strong": "This is a great start to Tableau, and I look forward to seeing how you develop your data visualizations from here.",
      "Needs Revision": "There is a lot to be proud of, and if you have any questions then make sure to reach out. I look forward to seeing your development as a data visualizer!",
      "Insufficient": "There is a lot to be proud of, and if you have any questions then make sure to reach out. If you get stuck on anything, make sure to use the skillbuilders, materials, drop-ins, and Bodhi your advantage. You got this!"
    },
    "signoff": {
      "Superior": "Take care",
      "Strong": "Take care",
      "Needs Revision": "Take care",
      "Insufficient": "Take care"
    }
  }
}
